using System.ComponentModel.DataAnnotations;

namespace StatementApplication.Data.Enums
{
    public enum LMDType
    {
        [Display(Name = "افادة سنة اولى انكليلزي")]
        افادة_سنة_اولى_انكليلزي,
        [Display(Name = "افادة سنة اولى فرنسي")]
        افادة_سنة_اولى_فرنسي,
        [Display(Name ="مقررات سنة ثانية انكليزي")]
        افادة_سنة_ثانية_انكليلزي,
        [Display(Name = "مقررات سنة ثانية فرنسي")]
        افادة_سنة_ثانية_فرنسي,
        [Display(Name = "مقررات سنة ثالثة انكليزي")]
        افادة_سنة_ثالثة_انكليلزي,
        [Display(Name = "مقررات سنة ثالثة فرنسي")]
        افادة_سنة_ثالثة_فرنسي,
        [Display(Name = "افادة انهاء بدون علامات انكليزي")]
        افادة_انهاء_بدون_علامات_انكليزي,
        [Display(Name = "افادة انهاء بدون علامات عربي")]
        افادة_انهاء_بدون_علامات_عربي,
        [Display(Name = "افادة انهاء بدون علامات فرنسي")]
        افادة_انهاء_بدون_علامات_فرنسي,
        [Display(Name = "افادة انهاء بالعلامات انكليزي")]
        افادة_انهاء_بالعلامات_انكليزي,
        [Display(Name = "افادة انهاء بالعلامات عربي")]
        افادة_انهاء_بالعلامات_عربي,
        [Display(Name = " افادة انهاء بالعلامات فرنسي")]
        افادة_انهاء_بالعلامات_فرنسي,

    }
}
